Courses/7370/Lectures/IPFS/BlockChain/pmNotes-BlockChain.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Block Chains 2018</title>
<!-- 2018-10-24 Wed 18:18 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
<meta  name="description" content="Mateti: Android Internals and Security"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">Block Chains 2018</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. End</a></li>
</ul>
</div>
</div>
<p>
Wish to learn this topic.  For myself.  Write a good tutorial for others.
</p>

<ol class="org-ol">
<li>See <a href="./IPFS">./IPFS</a>
</li>

<li><a href="https://www.quora.com/What-are-the-best-open-source-projects-to-study-blockchain-technology-in-terms-of-simplicity">https://www.quora.com/What-are-the-best-open-source-projects-to-study-blockchain-technology-in-terms-of-simplicity</a> 2016
</li>

<li>Arvind Narayanan, Joseph Bonneau, Edward Felten, Andrew Miller,
Steven Goldfeder, Bitcoin and Cryptocurrency Technologies, Draft —
Feb 9, 2016 Princeton.
<a href="https://www.coursera.org/learn/cryptocurrency">https://www.coursera.org/learn/cryptocurrency</a> Taught by: Arvind
Narayanan, Associate Professor
</li>

<li>Blockchain for Education: Lifelong Learning Passport, Wolfgang
Gräther Fraunhofer FIT Sankt Augustin, Germany
graether@fit.fraunhofer.de Sabine Kolvenbach Fraunhofer FIT Sankt
Augustin, Germany kolvenbach@fit.fraunhofer.de Rudolf Ruland
Fraunhofer FIT Sankt Augustin, Germany
rudolf.ruland@fit.fraunhofer.de Julian Schütte Fraunhofer AISEC
Garching, Germany schuette@aisec.fraunhofer.de Christof Ferreira
Torres University of Luxembourg Luxembourg christof.torres@uni.lu
Florian Wendland Fraunhofer AISEC Garching, Germany
wendland@aisec.fraunhofer.de
</li>

<li><a href="https://crypto.stanford.edu/cs251/syllabus.html">https://crypto.stanford.edu/cs251/syllabus.html</a> Fall 2018
</li>

<li><a href="http://cs.brown.edu/courses/csci2952-a/">http://cs.brown.edu/courses/csci2952-a/</a> Maurice Herlihy, CIT 341
Blockchain technology promises to revolutionize how modern society
deals with trust. Although cryptocurrencies such as Bitcoin are in
the news, the impact of this technology is likely to extend far
beyond such speculative bubbles, encompassing topics ranging from
identity management, to market making, to IOT security, and also
CryptoKitties.  Links to courses at U of Wash, Stanford, and
Berkeley.
</li>

<li><a href="http://muratbuffalo.blogspot.com/2018/01/spring-18-distributed-systems-seminar.html">http://muratbuffalo.blogspot.com/2018/01/spring-18-distributed-systems-seminar.html</a>
   a blockchain seminar.  Links to many papers.
</li>

<li><a href="http://www.decentralstation.com/">http://www.decentralstation.com/</a>  THIS SITE is a curated list of
links with an introductory essay. Feel free to skip the essay and
explore the links. 
</li>

<li><a href="https://news.ycombinator.com/item?id=14161695">https://news.ycombinator.com/item?id=14161695</a> <a href="https://status.im/">https://status.im/</a> A
Mobile Ethereum OS This app uses <i>re-natal</i>, a wrapper of React
Native for ClojureScript. It also uses a ClojureScript framework
called "re-frame" for data flow and "reagent" for wrapping
React. It's a pleasure to work with (most of the time, there are
hiccups here and there) and you can develop for iOS and Android
simultaneously. I highly recommend checking it
out. <a href="https://github.com/drapanjanas/re-natal">https://github.com/drapanjanas/re-natal</a>
<a href="https://github.com/status-im/status-react/">https://github.com/status-im/status-react/</a>;; Remarkably similar to
Token from Coinbase, which launched just yesterday:
<a href="https://www.tokenbrowser.com">https://www.tokenbrowser.com</a> ;; A decentralized cryptocurrency is a
lovely ideal, but in the dirty real world, Ethereum and its ilk
will win out.  You can find a comprehensive list of dapps here:
<a href="http://dapps.ethercasts.com">http://dapps.ethercasts.com</a>;; Is the intention here to run mini
react-native apps (Dapps?) within a bigger app (status app
itself)?;; Status is decentralized messaging platform to access the
Ethereum Network (Web 3.0). Essentially we're building a network
that's completely operated by it's own users, and runs entirely on
peer-to-peer technologies.  Users can send encrypted messages,
payments, and can interact and chat with decentralized
applications. What's exciting about Ethereum is it removes the need
not only for centralized servers, but also for intermediaries that
were traditionally required in order to partake in trade or legal
agreements. A good place to start if you'd like to learn more:
<a href="http://www.ethdocs.org/en/latest/introduction/what-is-ethere">http://www.ethdocs.org/en/latest/introduction/what-is-ethere</a>&#x2026;;;
Well, the other option is to explain how it's like existing methods
of delivering online functionality, but decentralised - a thing
that nobody really values - plus also incredibly slow, fairly
complex, and you have to pay for everything that happens, and also
the entire ecosystem is centred around a volatile speculation-rife
currency and an approach to financial transactions which has been
full of real and significant security problems - including the
theft of millions of dollars from the flagship implementation right
under the noses of many of the core devs, despite paying corrupt
levels of money to other core boosters of the platform for
completely hopeless security reviews&#x2026;
</li>

<li>Totally with you here. The blockchain is an awesome experiment and
prototype of what a good decentralized, verifiable system could
look like, but it has several significant flaws, some of which are
obvious even in the limited context of a worldwide ledger
(bitcoin).  In particular, throwing away 47 zetaflops/s of
computing power (the current compute power of the bitcoin network [
0]) and all of the electricity required to generate it in order to
verify the transactions of the tiny quantity of people currently
using bitcoin is obscene, and the mechanism that encourages this
should be recognized as the unscalable disaster that it is.  Basing
"Web 3.0" on such mechanisms is, frankly, a ridiculous proposition.
And all of this "decentralization" is thrown out the window by
virtually everyone, because to store a full copy of the blockchain
on your local disk, you need &#x2013; let's see &#x2013; =$ du -sh
<i>mnt/apps<sub>syn</sub>/dot<sub>bitcoin</sub></i> 118G <i>mnt/apps<sub>syn</sub>/dot<sub>bitcoin</sub></i> 120
gigabytes= of space. So you end up just trusting Coinbase or
whoever you have your wallet from anyway, no different than
trusting your bank.  If Coinbase had an Ethereum moment, they could
fork the chain that all of their wallets use, and with their
MtGox-like domination of the market, any resistance to their fork
would seriously damage Bitcoin overall. I imagine most miners would
go along with it because they don't want their btc to drop to 0.
Consider also that there is virtually no transparency into the
actual miner operations.  The biggest miners are behind "pools" &#x2013;
relays &#x2013; and though the idea is that pools are made up of tens of
thousands of independently-controlled computers, I suspect that if
we could see through to which machines were actually doing most of
the work, bitcoin would suddenly seem a lot less "decentralized".
This is not to mention that miners behind pools are totally at the
pool's mercy, or that 5 pools hold over 50% of the network's
hashrate, and that these pool operators have been in one room
together to decide on blockchain policy (re blocksize, which miners
are incentivized to oppose, since smaller blocksize == higher
transaction fees). That is little different than big banks meeting
under the auspices of the Federal Reserve to control monetary
policy.  It's very sad that people saw bitcoin and thought it was a
good idea to expand its flawed model out, instead of accepting it
for the forward-thinking prototype it was and thinking about how to
improve it before jumping all in.
</li>

<li><a href="https://bitcoinwatch.com">https://bitcoinwatch.com</a> Redirects to <a href="https://bitcoincharts.com/">https://bitcoincharts.com/</a>
Bitcoincharts provides financial and technical data related to the
Bitcoin network.
</li>

<li><a href="https://2030.io/">https://2030.io/</a>
</li>
</ol>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> End</h2>
<div class="outline-text-2" id="text-1">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2017 <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 2017-04-20
</div>
</body>
</html>
